#(8 ქულა) Დაწერეთ პროგრამა რომელიც მოხმარებელს მოსთხოვს შეიყვანოს მთელი რიცხვი n, სადაც 10 <= n <= 5432.
# Თუ მომხმარებელი შეიყვანს არასწორ რიცხვს ეკრანზე დაბეჭდეთ რომ პროგრამას გადმოეცა არასწორი რიცხვი და შეწყვიტეთ პროგრამის მუშაობა.
# Თუ მომხმარებელი შეიყვანს სწორ რიცხვს, პროგრამამ უნდა იპოვოს ყველა 13 ის ჯერადი რიცხვი 1-დან n-მდე.
# Ეკრანზე დაბეჭდოს ეს რიცხვები და მათი საერთო რაოდენობა.

n = int(input("გთხოვთ, შეიყვანეთ მთელი რიცხვი 10 <= n <= 5432: "))

counter = 0 
if n < 10 or n > 5432:
    print("არასწორი რიცხვია")
    quit()
else:
    for i in range (1, n):
        if i % 13 == 0:
            print(i)
            counter = counter + 1
    print(f"სულ ასეთი რიცხვის რაოდენობაა: {counter}")        